# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 3 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8sgai.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
# YOLOv8.0n backbone
# input 640*640*3
backbone:
  # [from, repeats, module, args]  通道数 卷积核大小 步长
  - [-1, 1, Conv, [16, 3, 2]] # 0-P1/2   320*320*64
  - [-1, 1, Conv, [64, 3, 2]] # 1-P2/4 160*128
  - [-1, 3, C2f, [64, True]]   #2  160*128

  - [-1, 1, Conv, [128, 3, 2]] # 3-P3/8  80*256
  - [-1, 6, C2f, [128, True]]   #4 80*256
  - [-1, 1, Conv, [256, 3, 2]] # 5-P4/16  40*512
  - [-1, 6, C2f, [256, True]]  #6 40*512

  - [-1, 1, Conv, [512, 3, 2]] # 7-P5/32  20*1024
  - [-1, 3, C2f, [512, True]]  # 8 20*1024
  - [-1, 1, SPPF, [512, 5]] # 9 20*1024
# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10 40*1024
  - [[-1, 6], 1, Concat, [1]] #11 cat backbone P4
  - [-1, 3, C2f, [256]] # 12
  #- [-1, 1, BiFormerBlock, [ 512 ] ] # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  #13
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [128]] # 15 (P3/8-small)
  #- [-1, 1, BiFormerBlock, [ 256 ] ] # 18

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4  12
  - [-1, 3, C2f, [256]] # 18 (P4/16-medium)
  #- [-1, 1, BiFormerBlock, [ 512 ] ] # 22

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5  9
  - [-1, 3, C2f, [512]] # 21 (P5/32-large)
  #- [-1, 1, BiFormerBlock, [ 1024 ] ] # 26

  - [[15, 18, 21], 1, Detect, [nc]] # Detect(P3, P4, P5) 15 18 21